// ignore: non_constant_identifier_names
Map<String, dynamic> data_type = {
  "data": [
    {
      "col": 0,
      "headTitle": "ข่าว",
      "subTitle": [
        {"type": 0, "text": "ข่าวทุนวิจัย", "link": ""},
        {"type": 1, "text": "ข่าวประกาศ", "link": ""},
        {"type": 2, "text": "ข่าวรับสมัครนักศึกษาระดับบัณฑิตศึกษา", "link": ""}
      ]
    },
    {
      "col": 1,
      "headTitle": "เกี่ยวกับบัญฑิต",
      "subTitle": [
        {"type": 0, "text": "วิสัยทัศน์/พันธกิจ", "link": ""},
        {"type": 1, "text": "นโยบายมหาวิทยาลัย", "link": ""},
        {"type": 2, "text": "โครงสร้างองค์กร", "link": ""},
        {"type": 3, "text": "รายงานประจําปี", "link": ""},
        {"type": 4, "text": "งานประกันคุณภาพ", "link": ""}
      ]
    },
    {
      "col": 2,
      "headTitle": "รับสมัครนักศึกษา",
      "subTitle": [
        {"type": 0, "text": "ปริญญาโท", "link": ""},
        {"type": 1, "text": "ปริญญาเอก", "link": ""}
      ]
    },
    {
      "col": 3,
      "headTitle": "หลักสูตร",
      "subTitle": [
        {"type": 0, "text": "หลักสูตรระดับปริญญาเอก", "link": ""},
        {"type": 1, "text": "หลักสูตรระดับปริญญาโท", "link": ""},
        {"type": 2, "text": "ขั้นตอนการจัดทำหลักสูตร", "link": ""},
        {"type": 3, "text": "มคอ.2", "link": ""},
        {"type": 4, "text": "ระเบียบ/ประกาศเกี่ยวกับหลักสูตร", "link": ""}
      ]
    },
    {
      "col": 4,
      "headTitle": "วิจัยและบริการวิชาการ",
      "subTitle": [
        {"type": 0, "text": "วิจัยและบริการวิชาการ", "link": ""},
        {"type": 1, "text": "วารสารวิชาการ", "link": ""},
        {"type": 2, "text": "ฐานข้อมูลการวิจัย", "link": ""},
        {
          "type": 3,
          "text": "งานบริการวิชาการ กิจกรรมต่าง ๆ \nที่จัดให้นักศึกษา",
          "link": ""
        }
      ]
    },
    {
      "col": 5,
      "headTitle": "บริการด้านข้อมูล",
      "subTitle": [
        {"type": 0, "text": "ปฏิทินนักศึกษา", "link": ""},
        {"type": 1, "text": "ข้อบังคับ/ประกาศหลักเกณฑ์", "link": ""},
        {"type": 2, "text": "ระเบียบ/ประกาศการเงิน", "link": ""},
        {"type": 3, "text": "คู่มือการทําวิทยานิพนธ์", "link": ""},
        {"type": 4, "text": "ดาวน์โหลดใบคําร้อง", "link": ""}
      ]
    },
    {
      "col": 6,
      "headTitle": "บุคลากร",
      "subTitle": [
        {"type": 0, "text": "ผู้บริหารและบุคลากร", "link": ""},
        {
          "type": 0,
          "text": "คณะกรรมการบริหารหลักสูตร\nปริญญาโทและปริญญาเอก",
          "link": ""
        },
        {"type": 0, "text": "คณะกรรมการอำนวนการ", "link": ""}
      ]
    }
  ]
};
